import React from 'react'

import { connect } from 'react-redux'

import { makeStyles } from '@material-ui/core/styles';

import { NavLink } from 'react-router-dom'
import { red } from '@material-ui/core/colors';

class Blog2 extends React.Component {
    createListItems() {
        const useStyles = makeStyles({
            root: {
                paddingBottom: 60,
                fontSize: 40, 
                maxWidth: 1200, 
                alignitems: 'center',
                justifyContent: 'center',
                width: 900,
                margin: 'auto',
                paddingRight: 900,
            },
        });
        const classes = useStyles;
        return (
            <div className={classes.root} key={this.props.blogs[1].key}>
                <h1>{this.props.blogs[1].title}</h1>
                <img src={this.props.blogs[1].image}></img>
            </div>
        )

    }
    render() {
        return (
            <div>
                {this.createListItems()}
                <div>

                </div>
                <p style={{fontSize: 20, maxWidth: 1200, justifyContent: 'center', margin: 'auto', textAlign: 'left' }}>
                    Начнем с того, что внутренний ребенок реален. Не буквально, не физически, но образно, метафорически реален. Это – как часть в целом – психологическая или феноменологическая реальность, причем чрезвычайно мощная. Действительно, большинство психических расстройств и деструктивных моделей поведения, как впервые указал Фрейд, 
                    более или менее связаны с этой бессознательной частью нас самих.<br/><br/>
                    Мы все когда-то были детьми, и в нас все еще есть этот ребенок. Но большинство взрослых совершенно не знают об этом. И это отсутствие сознательной связи с нашим внутренним ребенком – именно то, из-за чего возникает так много проблем в межличностных отношениях, а также поведенческих эмоциональных трудностей.<br/><br/>
                    Дело в том, что большинство взрослых – не совсем взрослые. Мы все становимся старше, но с психологической точки зрения, это не совсем взрослая жизнь. Истинная зрелость зависит от принятия, признания и ответственности за воспитание и любви к своему внутреннему ребенку. Для многих взрослых это так никогда и не происходит. 
                    Вместо этого их внутренний ребенок отвергнут и брошен, его игнорируют и пренебрегают внутренними потребностями.<br/>
                    Общество говорит нам "надо взрослеть", "отложите в сторону детские штучки". Нас учили, чтобы стать взрослыми, наш внутренний ребенок – представляющий нашу детскую способность к простоте, искреннему интересу и удивлению, радости, чувствительности и игривости – должен быть подавлен, заперт в чулан или даже убит. 
                    Внутренний ребенок объединяет и усиливает детские положительные качества. Но он также удерживает наши накопленные детские травмы, боль, страхи и гнев. Взрослые убеждены, что они успешно переросли, отбросили и оставили этого ребенка – и его эмоциональный багаж далеко позади. Но это далеко от истины.<br/><br/>
                    Фактически, эти так называемые повзрослевшие или взрослые невольно находятся под постоянным влиянием или скрытно контролируются этим бессознательным внутренним ребенком. Для многих это не взрослое "Я", руководящее их жизнью, а эмоционально раненый внутренний ребенок, находящийся во взрослом теле. 
                    Представьте себе, такой некий обиженный, злой и испуганный маленький мальчик или девочка, который принимает взрослые решения. Мальчик или девочка, посланные во взрослый мир, чтобы выполнять работу мужчины или женщины, или десятилетний ребёнок, пытающийся вступить во взрослые отношения. Может ли ребенок иметь зрелые отношения? 
                    Карьеру? Самостоятельную жизнь? Тем не менее, это именно то, что происходит со всеми нами каждый день, в той или иной степени. И тогда мы удивляемся, почему наши отношения рушатся. Почему мы чувствуем себя такими маленькими и потерянными, испытываем такую сильную тревогу, страх, чувство небезопасности и одиночества. 
                    Но подумайте: как ещё ребенок будет чувствовать себя во взрослом мире, где нужно постоянно выживать и защищать себя, без надлежащего родительского присмотра, защиты, структуры или поддержки?<br/><br/>
                    Такое запутанное положение вещей, часто наблюдается у тех, кто обращается к психотерапевтам и психологам. Но как решить эту проблему?<br/><br/>
                    Во-первых, человеку необходимо осознать своего внутреннего ребенка. Если он остаётся неосознанным, это позволяет ему, время от времени овладевать личностью и подчинять волю взрослого. Затем человеку следует научиться воспринимать своего внутреннего ребенка серьезно, и сознательно общаться с этой маленькой девочкой или мальчиком внутри:
                    прислушиваться, как он или она чувствует себя и что ему или ей нужно от нас здесь и сейчас. Часто неудовлетворенные первичные потребности этого вечного внутреннего ребенка – в любви, принятии, защите, заботе, понимании – остаются такими же актуальными сегодня, как и тогда, когда мы были детьми. Как псевдо-взрослые, мы тщетно пытаемся 
                    заставить других удовлетворять эти потребности в нас. Такие попытки обречены на провал.<br/><br/>
                    Наша взрослая часть личности должна научиться, относиться к внутреннему ребенку точно так же, как хороший родитель относится к своему ребёнку, обеспечивая любовь, полное принятие и границы. Все это – наряду с поддержкой, воспитанием и дисциплиной – обязательные элементы жизни с любым ребенком.<br/><br/>
                    Инициируя и поддерживая постоянный диалог между внутренним ребенком и зрелым взрослым, можно достичь примирения между ними. Могут быть созданы новые взаимовыгодные, кооперативные, симбиотические отношения, в которых творчески могут быть удовлетворены порой противоречивые потребности как взрослого "Я", так и внутреннего ребенка.<br/><br/>
                </p>
            </div>
        )
    }
}
function mapStateToProps(state) {
    return {
        blogs: state.blogs
    }
}
export default connect(mapStateToProps)(Blog2)