import React from 'react'

import { connect } from 'react-redux'

import { makeStyles } from '@material-ui/core/styles';

import { NavLink } from 'react-router-dom'
import { red } from '@material-ui/core/colors';

class Blog2 extends React.Component {
    createListItems(i) {
        return (
            <div key={this.props.blogs[i].key}>
                <h1>{this.props.blogs[i].title}</h1>
                <img src={this.props.blogs[i].image}></img>
                <div>
                    <p className="Card-text">

                        {this.props.blogs[i].description}
                    </p>
                </div>
            </div>
        )

    }
    render() {
        const useStyles = {
                marginTop: 40,
                fontSize: 20, 
                maxWidth: 1000, 
                alignitems: 'center',
                justifyContent: 'center',
                margin: 'auto',
                paddingTop: 25,
 
            }

        return (
            <div style={useStyles}>
                {this.createListItems(0)}
                <h2> Так что для этого сделать?</h2>
                <p style={{textAlign:'left'}}>
                    <h3>Ввести мораторий на ссоры</h3>
                    Вынужденное нахождение дома более месяца нужно воспринимать как чрезвычайную ситуацию, даже военное положение, - предупреждает Кристина Иваненко. Поэтому для пары очень важно ввести мораторий на любые выяснения отношений. "Вам еще месяц жить в одном пространстве, и хлопать дверью сейчас - не лучшее время", - рассказывает она. Да и докопаться до истины в условиях стресса и неопределенности все равно не получится. Так что "максимально берегите друг друга, словно вы только что вернулись с войны".
                    
                    <h3>Найти свой угол</h3>
                    Одна из главных ошибок сейчас - проводить все время вместе. В нормальной жизни отношения - это сменяющий друг друга ритм встреч и расставаний, который нужно стремиться сохранить. Даже в однокомнатной квартире нужно найти свой угол - поставить цветок, повесить ширму, отвернуть диван к окну. Это место, где каждый из партнеров будет заниматься чем-то своим, не сигнализирует о проблемах в отношениях. Напротив, позволит снизить напряжение и избежать конфликтов.
                    
                    <h3>Заниматься спортом</h3>
                    Столько слов уже сказано о том, что во время самоизоляции нужно всеми силами сохранять физическую форму, но, оказывается, нужно это не только для здоровья. Гиподинамия разрушительно влияет на наше самоощущение, а, значит, и на отношения. Час спорта в день снижает уровень стресса в разы, утверждают психологи. Даже если в обычной жизни вы обходили спортзал стороной, вспоминаем, сейчас - ситуация чрезвычайная.
                    
                    <h3>Не забывать о внешности</h3>
                    Брились раз в два дня раньше - делайте это столько же, пользовались декоративной косметикой - не стоит забывать о ней и сейчас. Чем больше многие из нас находятся дома, тем больше походят на бомжей, - сетует Наталья Толстая. В то же время наша собственная внешность зачастую становится фактором раздражения. Не партнера, хотя и это логично, а нас самих. И сейчас важно уделять ей не меньше внимания, чем в обычной жизни.
                    
                    <h3>Поддерживать гигиену. Эмоциональную</h3>
                    Это уже не про внешность, а про увлечения. Вы - любитель слэшеров и тяжелой музыки? От них лучше отказаться в пользу более нейтрального эмоционально и даже позитивного контента. В нестандартной ситуации тяжелая музыка и фильмы могут оказать угнетающее воздействие, даже если раньше вы без проблем проводили вечера за фильмами ужасов.
                    
                    <h3>Придерживаться расписания</h3>
                    Находясь дома 24/7, мы лишены структуры времени, которая была раньше. Речь идет о подъеме в одно и то же время, поездках на работу/учебу и проч. Сейчас нужно придумать новый тайминг, причем так, чтобы он более-менее совпадал с таймингом партнера. Как бы не претила вам жизнь по расписанию, сделайте исключение - вставайте в одно и то же время, старайтесь обедать и ужинать вместе. Это поможет вам эффективно потратить этот месяц (а может быть и больше) и справиться с удаленной работой/учебой, а там и до освоения чего-то нового недалеко. Благо, возможностей онлайн предостаточно. Чем больше удовлетворены результатами своей работы вы будете, тем больше позитивных ресурсов у вас будет для отношений.
                    
                    <h3 style={{color: 'red'}}>Ничего не помогает?</h3>
                    Если вы все равно постоянно раздражены партнером и не видите в вынужденном пребывании вместе решительно никакой радости, Кристина Иваненко советует помогать другим. Главное - делать это вместе. "Придумайте, как вы можете быть полезны вашим соседям, родственникам, благотворительным организациям. Если делать это вместе, это сближает и укрепляет отношения гораздо больше, чем совместный ужин и просмотр сериалов", - уверена она.
                    </p>
            </div>
        )
    }
}
function mapStateToProps(state) {
    return {
        blogs: state.blogs
    }
}
export default connect(mapStateToProps)(Blog2)