export default function(){
return[
    {
        id:1,
        title:'Как сохранить отношения во время карантина',
        image:"./img/blog1.jpg",
        description: 'Помните шутки на тему того, что после пандемии многие семьи распадутся?Смех смехом, а в Китае сейчас действительно всплеск бракоразводных процессов. С начала марта о росте числа разводов сообщили загсы более десяти крупных китайских городов, подсчитали в издании Financial Times. Русская служба Би-би-си спросила о том, как сохранить отношения в четырех стенах, у кандидата психологических наук Кристины Иваненко и психолога и писателя Натальи Толстой. Вот, что они советуют',
        link:'/blog1'
    },
    {
        id:2,
        title:'Ребенок внутри нас',
        image:"./img/blog2.jpg",
        description: 'Мы все когда-то были детьми, и в нас все еще есть этот ребенок. Но большинство взрослых совершенно не знают об этом. И это отсутствие сознательной связи с нашим внутренним ребенком – именно то, из-за чего возникает так много проблем в межличностных отношениях, а также поведенческих эмоциональных трудностей.',
        link:'/blog2'
    },
    {
        id:2,
        title:'Разве это возможно?',
        image:"./img/blog1.jpg",
        description: 'Помните шутки на тему того, что после пандемии многие семьи распадутся?Смех смехом, а в Китае сейчас действительно всплеск бракоразводных процессов. С начала марта о росте числа разводов сообщили загсы более десяти крупных китайских городов, подсчитали в издании Financial Times. Русская служба Би-би-си спросила о том, как сохранить отношения в четырех стенах, у кандидата психологических наук Кристины Иваненко и психолога и писателя Натальи Толстой. Вот, что они советуют',
        link:'/blog2'
    }
]

}