const reviews=[
        {
            id:1,
            name:'Анна',
            age: 28,
            image:"./img/1.jpeg",
            date: new Date('2019-10-7T03:14:00'),
            text: 'Обратилась к Сергею, потому что нервы уже были на пределе.Ситуация казалась мне безвыходной – несмотря на то, что я работаю и учусь.Сама не заметила, как избавилась от огромного кома.Наконец-то увидела выход из сложившейся ситуации и теперь есть надежда... Большое спасибо Захару.',
        },
        {
            id:2,
            name:'Людмила',
            age:33,
            image:"./img/2.jpg",
            date: new Date('2020-05-27T03:14:00'),
            text: 'Большое спасибо Сергею',
        },
        {
            id:3,
            name:'Анатолий',
            age:33,
            image:"./img/3.jpg",
            date: new Date('2018-10-17T03:14:00'),
            text: 'Огромное спасибо Сергею',
            
        }
    ]
    
    exports.reviews=reviews